// *********************************************************
// ********************* Массивы ***************************
// *********************************************************

"use strict";

// const arr = [1, 2, 3, 6, 8];

// arr.pop(); // удаление последнего элемента массива arr
// arr.push(10); // добавление элемента в конец массива arr

// ********* Перебор массива ***************
// for (let i = 0; i < arr.length; i++) {
//   console.log(arr[i]);
// }

// ********* Перебор массива  for of ***************

// можно испльзовать break и continue
// for (let value of arr) { 
//   console.log(value);
// }

// arr.forEach(function (item, i, arr) {
//   console.log(`порядковый номер ${i}: значение элемента ${item}, внутри массива ${arr}`);
// });

// *********************************************************
// *********************************************************
// *********************************************************

// Практические наиболее часто используемые методы массивов

// Превращает стоку в массив
const str = prompt("", "");
const products = str.split(", ");

// Объединение элементов массива в строку
const productsJoin = products.join("; ");

// Метод сортировки
// Сортировка строк по алфавиту
products.sort();


// Сортировка чисел
const arr = [1, 52, 23, 6, 18];
arr.sort(compareNum);

function compareNum(a, b) {
  return a - b;
}

console.log(arr);