// *********************************************************
// ******** Передача данных по ссылке и по значению ********
// *********************************************************

"use strict";


// Передача данных в примитивных типах данных по значению
let a = 5,
  b = a;

b = b + 10;

// console.log(a);
// console.log(b);

// ********************************************************

// Передача данных в объектах по ссылке
const obj = {
  a: 5,
  b: 1
};

const copy = obj;

copy.a = 10;

// console.log(copy); // Передает ссылку на obj
// console.log(obj);  // Изменения происходят в copy и obj т.к. copy - это ссылка

// **********************************************************